//
//  Task.swift
//  SwiftUITaskNetology
//
//  Created by Олеся on 15.05.2023.
//

import Foundation
//Домашнее задание к занятию SwiftUI
//
//Правила выполнения домашней работы:
//* В поле для сдачи домашней работы прикрепите ссылку на Pull Request проекта в репозитории проекта на Git.
//* Все задачи обязательны к выполнению для получения зачета, кроме задач со звездочкой. Можно сдавать задачи по частям. Зачёт по домашней работе проставляется после того, как приняты все задачи.
//* Любые вопросы по решению задач задавайте в чате учебной группы.
//
//Задача 1:
//Создайте новый проект в Xcode. Перепишите в свой проект код, который был на демо в вебинаре по этой теме. Это нужно для того, чтобы вы посмотрели на SwiftUI изнутри и поняли отличия от UIKit.
//
//Задача 2:
//Создайте два модификатора для текста:
//* для заголовка (жирный крупный текст, фоновый цвет)
//* для основного текста (регулярный текст без фона)
//
//Задача 3:
//Необходимо построить интерфейс входа в профиль страницы Profile приложения ВК с помощью SwiftUI: Пример.
//* поместить логотип VK
//* создать поля для ввода email и password
//* добавить кнопку login
//* в нижней части экрана воспроизвести ленту с кнопками и иконками
//
//Задача 4* (со звездочкой):
//Мы предлагаем вам дополнительное задание, чтобы потренироваться с использованием SwiftUI. Ваша задача - создать мини-приложение со списком ваших любимых персонажей фильмов или игр (для разнообразия предлагаем добавить минимум 15 разных персонажей).
//Приложение состоит из списка персонажей, который можно пролистывать. В списке указаны имя персонажа, откуда он (название фильма или игры) и его фото. Для создания меню используйте компонент List. Процесс создания меню описан в официальной документации. Изучите ее, чтобы понять этапы создания и внешний вид меню.
//
//Задача 5* (со звездочкой):
//Разработайте расширенный функционал для мини-приложения с персонажами из задачи 4. При нажатии на вашего персонажа должна появляться более подробная информация о нем.
