//
//  Data.swift
//  SwiftUITaskNetology
//
//  Created by Олеся on 16.05.2023.
//

import SwiftUI
 let data = [
    Friend(id: 1, name: "George Clooney", biography: """
Американский актёр, режиссёр, продюсер, и активист. Широкую известность получил после выходов телесериала «Скорая помощь» и фильма «От заката до рассвета».
           
           Лауреат премий «Оскар» и «Золотой глобус» в номинации «Лучшая мужская роль второго плана» за фильм «Сириана», обладатель премии «Золотой глобус» за роль миллионера Мэтта Кинга в драме «Потомки» (2011) и роль бежавшего заключённого в комедии «О, где же ты, брат?» (2000). Второй раз получил «Оскар» как продюсер в номинации «Лучший фильм» за фильм «Операция „Арго“». За этот же фильм был удостоен четвёртого «Золотого глобуса» и первой статуэтки BAFTA.

           В 2009 году был признан журналом Time одним из 100 влиятельнейших людей мира. Его гуманитарная деятельность включает работы по решению конфликта в Дарфуре, по признанию геноцида армян, помощь пострадавшим от землетрясения на Гаити.

           После продажи компании Casamigos Tequila Клуни возглавил рейтинг самых высокооплачиваемых актёров, опубликованный Forbes в 2018 году.

""", image: Image("George Clooney")),
    Friend(id: 2, name: "Brad Pitt", biography: """
Американский актёр и кинопродюсер. Лауреат двух премий «Золотой глобус», двух премий Американской Гильдии киноактёров и двух наград Британской киноакадемии. Обладатель премии «Оскар» как один из продюсеров фильма «12 лет рабства» — победителя в категории «Лучший фильм» на церемонии 2014 года — и за лучшую мужскую роль второго плана в картине «Однажды в Голливуде» (2020). До этого пять раз номинировался на премию «Оскар» (трижды — как актёр и два раза — как продюсер).


""", image: Image("Brad Pitt")),
    Friend(id: 3, name: "Matt Damon", biography: """
Американский актёр кино, телевидения и озвучивания, сценарист и продюсер. Лауреат премии «Оскар» и двух премий «Золотой глобус», а также номинант на премию BAFTA.

Наиболее известные фильмы с участием Мэтта Деймона: драма «Умница Уилл Хантинг» (1997), «Спасти рядового Райана» (1998), «Догма» (1999), криминальная драма «Талантливый мистер Рипли» (1999); три части о приключениях друзей Оушена: «Одиннадцать друзей Оушена» (2001), «Двенадцать друзей Оушена» (2004), «Тринадцать друзей Оушена» (2007); тетралогия о Джейсоне Борне: «Идентификация Борна» (2002), «Превосходство Борна» (2004), «Ультиматум Борна» (2007) и «Джейсон Борн» (2016); а также фильмы «Отступники» (2006), «Интерстеллар» (2014), «Марсианин» (2015) и «Ford против Ferrari» (2019).
""", image: Image("Matt Damon")),
    Friend(id: 4, name: "Al Pacino", biography: """
Американский актёр, режиссёр и сценарист.

Наиболее знаменит своими ролями гангстеров — Майкл Корлеоне в трилогии «Крёстный отец» Фрэнсиса Форда Копполы и Тони Монтана в фильме Брайана Де Пальма «Лицо со шрамом» (1983). Роль Фрэнка Слейда в фильме «Запах женщины» (1992) принесла актёру «Оскар» в номинации Лучшая мужская роль, что стало его первым успехом после семи предыдущих номинаций.

Аль Пачино дебютировал в кино в 1969 году в фильме «Я, Натали», сыграв в нём незначительную второстепенную роль. В 1971 году он снялся во втором фильме, но теперь уже сыграл главную роль в драме «Паника в Нидл-Парке». В этом фильме актёра заметил Коппола и пригласил в «Крёстный отец» на роль Майкла Корлеоне.

Помимо удачной карьеры в кино, Аль Пачино является знаковым театральным актёром. В 1969 и 1977 годах он был награждён престижной театральной премией «Тони». Кроме того, он является обладателем множества других наград, в том числе и от Американского института киноискусства. Аль Пачино вместе с Эллен Бёрстин возглавляет Актёрскую студию в Нью-Йорке.
""", image: Image("Al Pacino")),
    Friend(id: 5, name: "Don Cheadle", biography: """
Американский актёр, кинопродюсер и режиссёр, дважды лауреат премии «Золотой глобус» (1999, 2013), номинант на премии «Оскар» (2005), BAFTA (2006 — дважды) и «Эмми» (1999 — дважды, 2002, 2003, 2012).

Наибольшую популярность получил благодаря ролям в фильмах «Крысиная стая» (1998), «Траффик» (2000), «Пароль „Рыба-меч“» (2001), «11 друзей Оушена» (2001), «Столкновение» (2004), «Отель „Руанда“» (2004), «Предатель» (2008), а также ролью персонажа комиксов Джеймса Роудса в 6 фильмах: «Железный человек 2» (2010), «Железный человек 3» (2013), «Мстители: Эра Альтрона» (2015), «Первый мститель: Противостояние» (2016), «Мстители: Война бесконечности» (2018) и «Мстители: Финал» (2019).
""", image: Image("Don Cheadle"))
   ,  Friend(id: 6, name: "Elliott Gould", biography: """
Гулд родился в Бенсонхерсте, Бруклин, Нью-Йорк, в еврейской семье выходцев из Восточной Европы. Его мать, Люсиль (урождённая Рэйвер), продавала искусственные цветы, а отец, Бернард Голдштейн, работал поставщиком текстиля в Швейном квартале.
""", image: Image("Elliott Gould")),
    Friend(id: 7, name: "Casey Affleck", biography: """
Американский актёр театра, кино и телевидения, а также кинорежиссёр, кинопродюсер и сценарист.

Лауреат премий «Оскар», «Золотой глобус» и BAFTA (все — 2017 года) за главную роль в драме «Манчестер у моря». Младший брат Бенa Аффлека.


""", image: Image("Casey Affleck")),
    Friend(id: 8, name: "Scott Caan", biography: """
Американский актёр кино и телевидения, сын Джеймса Каана. Наиболее известен по роли Тёрка Мэллойя в фильме «11 друзей Оушена» и его продолжениях, а также по роли Дэнни Уильямса в телесериале «Гавайи 5.0».
""", image: Image("Scott Caan")),
    Friend(id: 9, name: "David Paymer", biography: """
Дэвид родился 30 августа 1954 года в семье музыканта и бывшего бизнесмена Марвина и его жены Сильвии, работавшей в сфере турбизнеса. Семья матери актёра во время Второй мировой сбежала из Бельгии. Родители Пеймера, имевшие традиционное еврейское воспитание, настаивали, чтобы юный Дэвид пошёл учиться на врача или юриста. Но Дэвид с раннего детства мечтал быть актёром. Когда отец оставил бизнес и решил заняться музыкой, это лишь больше укрепило Пеймера-младшего в его устремлениях.

Он закончил Мичиганский университет, получив статус бакалавра искусств. Учился в Институте Ли Страсберга в Профессиональной Школе Исполнительных видов искусства (Professional Performing Arts School).

Карьеру в кино Дэвид Пеймер начал в 1979 году с криминальной комедии Артура Хиллера «Свояки». Снялся более чем в 90 фильмах и телесериалах. Номинировался на «Оскар» и «Золотой глобус» за роль в дебютной ленте Билли Кристала «Мистер субботний вечер» и на «Золотой глобус» за лучшую мужскую роль второго плана в мини-сериале или фильме на ТВ в телефильме «Преступление века».


""", image: Image("David Paymer")),
    Friend(id: 10, name: "Ellen Barkin ", biography: """
Баркин родилась в Бронксе, штат Нью-Йорк, в семье Эвелин (в девичестве Розин), администратора госпиталя и Сола Баркин, продавца химических препаратов. Баркин росла в небогатой еврейской семье, предками которой были эмигранты из России и территории, расположенной на белорусско-польской границе. Баркин получила среднее образование в школе искусств в Манхеттане. После продолжила своё обучение в Хантерском Колледже. Имеет диплом не только по драматическому мастерству, но и по истории. В одно время актриса хотела стать преподавателем истории Древнего мира. Далее, продолжила своё образование в Актёрской студии в Нью-Йорке. Согласно статье в журнале Time, пока Эллен не прошла первое удачное прослушивание, ей пришлось в течение 10 лет ходить на курсы.
""", image: Image("Ellen Barkin ")),
    Friend(id: 11, name: "Eddie Jemison", biography: """

место рождения    Новый Орлеан, Луизиана, США
карьера    1995 — ...
жанры    драма, комедия, криминал
рост    1.66 м

""", image: Image("Eddie Jemison")),
    Friend(id: 12, name: "Andy Garcia", biography: """
Американский актёр, кинорежиссёр, кинопродюсер кубинского происхождения. Номинант на премию «Оскар» за роль второго плана в гангстерской драме «Крёстный отец 3».
""", image: Image("Andy Garcia")),
    Friend(id: 13, name: "Eddie Izzard", biography: """
Британская стендап-комик, актриса, писательница и активистка. Её комедийный стиль: хаотичный, эксцентричный монолог и самоотносительные пантомимы. Кроме гастролей она снимается на телевидении и в кино, играет в спектаклях и занимается благотворительностью.
""", image: Image("Eddie Izzard")),
    
    
 ]
